zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_ipc_bt.h
    uint32_t ulChannelHPC;                                    /**< HPC Channel used to send to BLE */
    uint32_t dlChannelHPC;                                    /**< HPC Channel used to receive from BLE */

    uint32_t intStuctureSelf;                                 /**< Interrupt structure for the MCU */
    uint32_t intStucturePeer;                                 /**< Interrupt structure for the BLE */

    uint32_t intPeerMask;                                     /**< Interrupt mask for the peer */

    uint32_t dlNotifyMask;                                    /**< Down link notify mask */
    uint32_t ulReleaseMask;                                   /**< Up link release mask */

    cy_stc_sysint_t ipcIntConfig;                             /**< IPC Interrupt configuration structure */

    cy_ipc_bt_irq_handler_t irqHandlerPtr;                    /**< This handler will be removed later once simulations are done */

    cy_ipc_bt_int_cb_ptr_t internal_hpc_notify_cb;            /**< This callback will be removed later once simulations are done */

    cy_ipc_bt_callback_ptr_t dlNotifyCallbackPtr;             /**< Callback function called when the DL message is received */

    cy_ipc_bt_relcallback_ptr_t ulReleaseCallbackPtr;         /**< Callback function called when the UL channel is released */

    cy_ipc_bt_bufcallback_ptr_t bufCallbackPtr;               /**< Callback function called when there is a free buffer available */

    cy_stc_ipc_hcp_cb_t hpcNotifyCallbackParam[MAX_BT_IPC_HPC_CB]; /**< Array of callback pointers registered for control channel notification */

    cy_stc_ipc_bt_buf_t buffPool[MAX_BUF_COUNT];              /**< Storage for pool of buffers sent by BLE for communication */

    cy_stc_ipc_msg_fifo_t IpcFifo;                            /**< FIFO for HCI IPC messages sent by BLE for communication */

    cy_stc_ipc_bt_buf_t toFreeBuf[MAX_TO_FREE_BUF_COUNT];     /**< Array of buffer descriptor of HCI long buffer to be released is stored */

    uint32_t droppedHCI;                                      /**< Count of dropped HCI messages */
    uint8_t bootType;                                         /**< Boot type */
    uint32_t certError;                                       /**< Certificate processing error description */

#ifdef CY_BTIPC_STATS
    /* Following data is used for analyses */
    uint32_t ipc_int_count;                                   /**< Total number of IPC interrupts received */

    uint32_t ipc_hci_cmd_count;                               /**< Total number of HCI cmds received */
    uint32_t ipc_hci_release_count;                           /**< Total number of HCI release received */

    uint32_t ipc_hci_notify_count;                            /**< Total number of HCI notifications received */
    uint32_t ipc_hci_peer_release_count;                      /**< Total number of releases done to peer HCI channel */

    uint32_t ipc_hpc_cmd_count;                               /**< Total number of HPC cmds received */
    uint32_t ipc_hpc_release_count;                           /**< Total number of HPC notifications received */

    uint32_t ipc_hpc_notify_count;                            /**< Total number of HPC notifications received */
    uint32_t ipc_hpc_peer_release_count;                      /**< Total number of releases done to peer HPC channel */

    uint32_t ipc_hci_peer_inbuf_count;                        /**< Total number of HCI buffers received */
    uint32_t ipc_hci_peer_outbuf_count;                       /**< Total number of HCI buffers returned */

    uint32_t ipc_hpc_peer_inbuf_count;                        /**< Total number of HPC buffers received */
    uint32_t ipc_hpc_peer_outbuf_count;                       /**< Total number of HPC buffers returned */

    uint32_t ipc_hci_cmd_self_outbuf_count;                   /**< Total number of HCI cmd buffers pulled form pool */
    uint32_t ipc_hci_cmd_self_outbuf_success;                 /**< Total number of HCI cmd buffers sent to peer */
    uint32_t ipc_hci_cmd_self_inbuf_count;                    /**< Total number of HCI cmd buffers received back from peer */

    uint32_t ipc_hci_fifo_full;                               /**< Total FIFO full condition count */
    uint32_t ipc_hci_notify_in_fifo_full;                     /**< HCI Notify received during FIFO full condition */
#endif
} cy_stc_ipc_bt_context_t;

/**
* This is the definition of BT IPC context structure used to restore and retrieve during RAM off state.
*/
typedef struct cy_stc_ipc_bt_save_ctxt_t
{
    cy_stc_ipc_bt_ctxbuf_t buffPool[MAX_BUF_COUNT];              /**< Storage for pool of buffers sent by BLE for communication */
} cy_stc_ipc_bt_save_ctxt_t;

/**
* This is the definition of BT IPC configuration structure.
*/
typedef struct cy_stc_ipc_bt_config_t
{
    uint32_t ulChannelHCI;                                    /**< HCI Channel used to send to BLE */
    uint32_t dlChannelHCI;                                    /**< HCI Channel used to receive from BLE */

    uint32_t ulChannelHPC;                                    /**< HPC Channel used to send to BLE */
    uint32_t dlChannelHPC;                                    /**< HPC Channel used to receive from BLE */

    uint32_t intStuctureSelf;                                 /**< Interrupt structure for the MCU */
    uint32_t intStucturePeer;                                 /**< Interrupt structure for the BLE */

    cy_stc_sysint_t ipcIntConfig;                             /**< IPC Interrupt configuration structure */

    cy_ipc_bt_irq_handler_t irqHandlerPtr;                    /**< This handler will be removed later once simulations are done */

    cy_ipc_bt_int_cb_ptr_t internal_hpc_notify_cb;            /**< This callback will be removed later once simulations are done */

    cy_ipc_bt_relcallback_ptr_t ulReleaseCallbackPtr;         /**< Callback function called when the UL channel is released */

    cy_ipc_bt_bufcallback_ptr_t bufCallbackPtr;               /**< Callback function called when there is a free buffer available */
} cy_stc_ipc_bt_config_t;

/**
* This is the definition of HPC IOSS config msg structure.
*/
typedef __PACKED_STRUCT cy_stc_ipc_msg_iocfg_t
{
    uint8_t msgId;                                  /**< Message ID for HPC message */
    uint8_t dummy1;                                 /**< Dummy byte to be ignored */
    uint16_t mode;                                  /**< IO config mode */
    uint32_t dummy2;                                /**< Dummy word to be ignored */
} cy_stc_ipc_msg_iocfg_t;

/**
* This is the definition of HPC TRNG msg structure.
*/
typedef __PACKED_STRUCT cy_stc_ipc_msg_trng_t
{
    uint8_t msgId;                                  /**< Message ID for HPC message */
    uint8_t dummy1;                                 /**< Dummy byte to be ignored */
    uint8_t dummy2;                                 /**< Dummy byte to be ignored */
    uint8_t dummy3;                                 /**< Dummy byte to be ignored */
    uint32_t trng;                                  /**< Dummy when sent to BTSS. TRNG when received from BTSS */
} cy_stc_ipc_msg_trng_t;

/**
* This is the definition of HPC PM request structure.
*/
typedef __PACKED_STRUCT cy_stc_ipc_msg_pmcmd_t
{
    uint8_t msgId;                                  /**< Message ID for HPC message */
    uint8_t dummy1;                                 /**< Not used */
    uint16_t dummy2;                                /**< Not used */
    uint32_t pm_op;                                 /**< Power management operation */
} cy_stc_ipc_msg_pmcmd_t;

/**
* This is the definition of HPC PM response structure.
*/
typedef __PACKED_STRUCT cy_stc_ipc_msg_pmresp_t
{
    uint8_t msgId;                                  /**< Message ID for HPC message */
    uint8_t dummy1;                                 /**< Not used */
    uint16_t dummy2;                                /**< Not used */
    uint32_t pm_resp;                               /**< Response form BT for power management command */
} cy_stc_ipc_msg_pmresp_t;

/**
* This is the definition of HPC resource access request structure from BTSS to MCU
*/
typedef __PACKED_STRUCT cy_stc_ipc_msg_res_access_req_t
{
    uint8_t msgId;                                  /**< Message ID for HPC message */
    uint8_t dummy1;                                 /**< Not used */
    uint16_t dummy2;                                /**< Not used */
    uint32_t access_ctrl;                           /**< Access enable/disable control */
} cy_stc_ipc_msg_res_access_req_t;

/**
* This is the definition of HPC resource access response structure from MCU to BTSS
*/
typedef __PACKED_STRUCT cy_stc_ipc_msg_res_access_resp_t
{
    uint8_t msgId;                                  /**< Message ID for HPC response */
    uint8_t dummy1;                                 /**< Not used */
    uint16_t dummy2;                                /**< Not used */
    uint32_t result;                                /**< result of access request */
} cy_stc_ipc_msg_res_access_resp_t;

/**
* This is the definition of HPC structure to indicate LPO change from MCU to BTSS
*/
typedef __PACKED_STRUCT cy_stc_ipc_msg_clklf_switch_t
{
    uint8_t msgId;                                  /**< Message ID for HPC message */
    uint8_t mode;                                   /**< LPO source 0 = PILO, 1 = WCO */
    uint8_t dummy1;                                 /**< Not used */
    uint8_t dummy2;                                 /**< Not used */
    uint32_t param;                                /**< WCO calibration offset in ppm */
} cy_stc_ipc_msg_clklf_switch_t;

/**
* This is the definition of HPC structure to indicate cbuk inrush mode from MCU to BTSS
*/
typedef __PACKED_STRUCT cy_stc_ipc_msg_inrush_mode_t
{
    uint8_t msgId;                                  /**< Message ID for HPC message */
    uint8_t mode;                                   /**< inrush mode 0 = LOW, 1 = HIGH */
    uint8_t dummy1;                                 /**< Not used */
    uint8_t dummy2;                                 /**< Not used */
    uint32_t dummy3;                                /**< Not used */
} cy_stc_ipc_msg_inrush_mode_t;

/**
* This is the definition of HPC structure to indicate buffer removal from BTSS to MCU
*/
typedef __PACKED_STRUCT cy_stc_ipc_msg_buf_remove_t
{
    uint8_t msgId;                                  /**< Message ID for HPC message */
    uint8_t bufType;                                /**< Buffer type indicator */
    uint8_t dummy1;                                 /**< Not used */
    uint8_t dummy2;                                 /**< Not used */
    uint32_t dummy3;                                /**< Not used */
} cy_stc_ipc_msg_buf_remove_t;
/** \} group_ipc_bt_data_structures */


/**
* \addtogroup group_ipc_bt_functions
* \{
*/
/*******************************************************************************
* Function Name: Cy_BTIPC_Init
****************************************************************************//**
*
* This function initializes the Bluetooth IPC. The IPC channels used for HCI and HPC packet exchange
* between MCU and BT SS are initialized.
*
* \note In general, this function is called during application initialization.
*
* \param btIpcConfig
* This is the pointer to the bt ipc configuration structure.
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure.
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:          BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR:            BT IPC API return for general error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE: BT IPC API return for bad handle
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_Init(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_bt_config_t * btIpcConfig);


