zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_ipc_bt.h
/*******************************************************************************
* Function Name: Cy_BTIPC_WarmInit
****************************************************************************//**
*
* This function performs the warm initialization of the Bluetooth IPC.
*
* \note In general, this function is called during application warm boot initialization.
*
* \param btIpcConfig
* This is the pointer to the bt ipc configuration structure.
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure.
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:          BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR:            BT IPC API return for general error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE: BT IPC API return for bad handle
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_WarmInit(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_bt_config_t * btIpcConfig);


/*******************************************************************************
* Function Name: Cy_BTIPC_Deinit
****************************************************************************//**
*
* This function de-initializes the Bluetooth IPC. All the registered callbacks are deleted.
*
* \note In general, this function is called when the application does not need BT IPC service
* anymore.
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure.
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:          BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE: BT IPC API return for bad handle
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_Deinit(cy_stc_ipc_bt_context_t *btIpcContext);


/*******************************************************************************
* Function Name: Cy_BTIPC_HCI_getPTI
****************************************************************************//**
*
* This function gets the payload type indicator and the length of the HCI packet received
* from BTSS. This function can be called to find out the type of HCI packet and allocate
* buffer of appropriate size to copy the packet data.
*
* \note In general, this function is called before reading the packet to allocate memory
* of required size.
*
* \param pti
* This is the pointer to payload type indicator which is returned by the function.
*
* \param p_length
* This is the pointer to the length of the payload filled by the function.
*
* \param msgPtr
* This is the pointer to buffer which contains the IPC data received in DATA0 and DATA1
* registers.
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:          BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE: BT IPC API return for bad handle
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_getPTI (cy_en_btipc_hcipti_t *pti, uint32_t *p_length, uint32_t *msgPtr);


/*******************************************************************************
* Function Name: Cy_BTIPC_HCI_Write
****************************************************************************//**
*
* This function sends the HCI packet form the BT stack to the BTSS.
*
* \param pti
* This is the HCI payload type indicator.
*
* \param data
* This is the pointer to the buffer holding the HCI payload.
*
* \param length
* This is the length of the HCI payload in number of bytes.
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:            BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE:   BT IPC API return for bad handle
*    CY_BT_IPC_DRV_ERROR_LOCK_ACQUIRE: BT IPC API return for buffer pool full error
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_Write(cy_stc_ipc_bt_context_t *btIpcContext, cy_en_btipc_hcipti_t pti, void *data, size_t length);


/*******************************************************************************
* Function Name: Cy_BTIPC_HPC_Write
****************************************************************************//**
*
* This function sends the HPC packet form the MCU to the BTSS.
*
* \param data
* This is the pointer to the buffer holding the HPC payload.
*
* \param length
* This is the length of the HPC payload in number of bytes.
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:            BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE:   BT IPC API return for bad handle
*    CY_BT_IPC_DRV_ERROR_LOCK_ACQUIRE: BT IPC API return for buffer pool full error
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_HPC_Write(cy_stc_ipc_bt_context_t *btIpcContext, void *data, size_t length);


/*******************************************************************************
* Function Name: Cy_BTIPC_HCI_GetReadBufPtr
****************************************************************************//**
*
* This function gets the pointer to the received HCI packet by MCU from BTSS.
*
* \param ppData
* This is the pointer to the pointer of received HCI payload buffer
*
* \param pLength
* This is the pointer to the size of the payload received in number of bytes
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:             BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE:    BT IPC API return for bad handle
*    CY_BT_IPC_DRV_ERROR_LOCK_ACQUIRE:  BT IPC API return for buffer pool full error
*    CY_BT_IPC_DRV_ERROR_LOCK_REL:      BT IPCAPI return for channel release error
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_GetReadBufPtr (cy_stc_ipc_bt_context_t *btIpcContext, void **ppData, size_t* pLength);


/*******************************************************************************
* Function Name: Cy_BTIPC_HCI_GetWriteBufPtr
****************************************************************************//**
*
* This function gets the pointer to the buffer to write HCI packet to send to BTSS.
*
* \param pti
* This is the HCI payload type indicator.
*
* \param ppData
* This is the pointer to the pointer of buffer to write HCI payload buffer
*
* \param length
* This is the length of the HCI payload in number of bytes.
*
* \param btIpcContext
* This is the pointer to the bt ipc context structure
*
* \return
*    CY_BT_IPC_DRV_SUCCESS:             BT IPC API return for no error
*    CY_BT_IPC_DRV_ERROR_BAD_HANDLE:    BT IPC API return for bad handle
*    CY_BT_IPC_DRV_ERROR_LOCK_ACQUIRE:  BT IPC API return for buffer pool full error
*    CY_BT_IPC_DRV_ERROR_LOCK_REL:      BT IPCAPI return for channel release error
*
*******************************************************************************/
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_GetWriteBufPtr(cy_stc_ipc_bt_context_t *btIpcContext, cy_en_btipc_hcipti_t pti, void **ppData, size_t length);


